Revit 2024 API
IFCGeometryInfo Class
 A container class for Revit geometry extracted from an element.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class IFCGeometryInfo : IDisposable
Visual Basic
Public Class IFCGeometryInfo _
	Implements IDisposable
Visual C++
public ref class IFCGeometryInfo : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCGeometryInfo
See Also
IFCGeometryInfo Members
Autodesk.Revit.DB.IFC Namespace